{"/docs/advanced-topics/":{"data":{"":" NCalc and RPN, which one to use, and where Few concrete examples using preconditions, config references, MF variables Light and power logic, backlight dimmer Transponder with one rotary Link to Neil’s blog posts to look up events Troubleshooting guide Intro to using LUA for x-plane Extending MobiFlight: Custom output devices "},"title":"Advanced topics"},"/docs/features/":{"data":{"":"Maybe like this."},"title":"Features"},"/docs/getting-started/":{"data":{"":" Flight simulator connection: MSFS+WASM / XPlane, sim status menu Arduino Connected devices, Firmware flashing Adding a switch and led, wiring. Maybe a link to some good electronics 101 guide? Parking brake switch and led tutorial (MSFS) Joysticks and MIDI Setting up, making sure support is enabled, how to find controls in MF Parking brake example with both basic Joystick and Midi (Xtouch?) (MSFS) XPlane and FSUIPC connections - quick overview WinWing / MiniFCU / Other off the shelf panels Pointers to FAQ / wiki pages Links to Flightsim.to / Xplane.to for profiles / @otyq profile list on github "},"title":"Getting started"},"/docs/getting-started/supported-boards/":{"data":{"":"","#":"There is a wide range of Arduino module types available on the market, but not all modules are supported by MobiFlight. Please use the following information to make the right choice when buying an arduino module. Especially, take a look at the list of boards that are not supported - names of the Arduino boards are sometimes very similar, so double-check that when ordering your board.\nSupported modules The following arduino modules are currently supported:\nArduino Mega 2560 R3 (AT2560 chip) or compatible board Arduino Mega 2560 Pro Mini (AT2560 chip) or compatible board Arduino Uno (AT328P chip) or compatible board Arduino Nano (AT328P chip) or compatible board Arduino Pro Micro (AT16U4 chip) or compatible board Raspberry Pi Pico (RP2040 chip) or compatible board Most clones work flawlessly. If your module is not detected by MobiFlight, it might have a new Vendor ID (VID) and Product ID (PID) which is not recognized, yet. Please report this in the forum.\nExperimental modules Raspberry Pi Pico (MobiFlight 9.7) Not supported modules The following are not supported but might have a very similar sounding name, so don’t confuse them by accident.\nArduino Mini - not available anymore Arduino Micro Arduino Pro Mini Arduino Leonardo any other Arduino module not on the list (see Supported Modules) ","download-driver-for-windows#Download driver for Windows":" For Windows 10, the generic Arduino Uno \u0026 Mega Driver is already inculded and your Arduino should be detected correctly. CH-340 based chipsets\nMany of the Arduino Mega clones these days come with a different chipset, namely CH-340. These modules will not be automatically detected correctly by Windows and also won’t show in MobiFlight. You will have to install the CH-340 chipset drivers manually.\nSo, if you have a CH-340 based Arduino, follow the tutorial for the CH-340 driver installation on the SparkFun website. FTDI based chipsets\nIf your Arduino is still not correctly detected by Windows and still doesn’t show in MobiFlight, chances are that it is using a different chipset based on FTDI. You can verify by opening Device Manager, and check the information for your board (it should show a yellow excalmation mark). The properties will likely mention FTDI in one of the sections.\nSo if you have a FTDI chipset based Arduino, follow the tutorial for the FTDI driver installation on the SparkFun website. Older Windows Versions\nFirst of all, consider upgrading your older windows version to Win10. If you still have to stick to your older version, the necessary driver is part of the Arduino Software which you can download at Arduino.cc-page directly werden.\nThe installation of the driver is also documented on the official arduino website\nAgain, do yourself a favor and consider upgrading your Windows installation as soon as possible.","installation#Installation":" Connect, install arduino driver, start Mobiflight Connector, Upload Mobiflight Firmware, use it - it’s so easy!\nComplete the following steps for a successful installation:\nConnect the Arduino Board via an USB cable - directly at the PC or preferrably on your USB Hub with external power supply If it is your first arduino board, you have to install the Driver for Windows so that the board is recognized. Now start MobiFlight Connector The arduino board will be detected as a compatible board Upload the MobiFlight Firmware to your Arduino board with the built-in Upload function of Mobiflight Connector Congratulations! - You now have your own MobiFlight Board After having uploaded the MobiFlight Firmware you can configure the module according to your needs. Go to “Extras” \u003e “Settings” \u003e “MobiFlight Modules” - or - click “MobiFlight Modules” on the toolbar."},"title":"Supported boards"},"/docs/hardware/":{"data":{"":" Flight simulator connection: MSFS+WASM / XPlane, sim status menu Arduino Connected devices, Firmware flashing Adding a switch and led, wiring. Maybe a link to some good electronics 101 guide? Parking brake switch and led tutorial (MSFS) Joysticks and MIDI Setting up, making sure support is enabled, how to find controls in MF Parking brake example with both basic Joystick and Midi (Xtouch?) (MSFS) XPlane and FSUIPC connections - quick overview WinWing / MiniFCU / Other off the shelf panels Pointers to FAQ / wiki pages Links to Flightsim.to / Xplane.to for profiles / @otyq profile list on github "},"title":"Hardware"},"/docs/hardware/input-shift-register/":{"data":{"connecting-multiple-chips-in-series#Connecting multiple chips in series":"MobiFlight supports up to four 74HC165 chips connected in parallel. When wiring the chips, it is important to wire them so the right most chip in the series is the one connected to the Arduino’s data input line. The clock and latch pins are shared across all chips.\n(Buttons and pull-up resistors omitted for clarity)\nAfter wiring the chips in series change the module configuration for the input to specify the number of chips connected in series. The resulting pin numbers in the input configuration dialog are determined by the order the chips are daisy chained together: Pins 0-7 are for the rightmost chip that is directly connected to the Arduino in the above schematic, 8-15 for the second from the right as that is the second in the chain, etc.. Using the debug log feature in MobiFlight will let you also see which number any given switch connected to the shift register is.","device-configuration---input-shift-register#Device configuration - input shift register":"Configure a new device for your Arduino in MobiFlight as follows:\nIf you choose to use pins other than 2, 3 and 4 here is how you should map the dropdowns in MobiFlight to the pins on the 74HC165:\nMobiFlight Setting 74HC165 input 74HC165 pin Latch SH/~LD 1 Clock CLK 2 Data QH 9 ","making-the-connections#Making the connections":"Connect the 74HC165 to your Arduino and the buttons as follows. The resistors are required on every input pin, even if you aren’t attaching a button to that pin:\nWhile the wiring diagram shows an 8-position DIP switch you can use 8 individual tactile buttons instead.","mobiflight-configuration---button-input#MobiFlight configuration - button input":"For each input you want to connect to a button configure the input as follows:\nThe dropdown next to the device name selects which pin on the 74HC165 is mapped to the input configuration. The mapping is as follows, assuming the chip is wired as illustrated earlier in this tutorial:\nMobiFlight Pin 74HC165 input 74HC165 pin 0 A 11 1 B 12 2 C 13 3 D 14 4 E 3 5 F 4 6 G 5 7 H 6 ","what-youll-need#What you\u0026rsquo;ll need":"As you continue to build panels you may encounter situations where you have more buttons for input than there are pins available on your Arduino. The solution is to use an input shift register like the 74HC165. These allow you to read input from eight buttons while only using three pins on the Arduino.\nMobiFlight supports up to 32 bits of shift registers in a chain (typically four eight-bit chips), and up to six chains of input shifters can be connected to a single Arduino.\nWhat you’ll need A 74HC165 chip Eight buttons Eight 10kΩ resistors A 0.1uF capacitor The chip is available anywhere you buy electronics, including Amazon, eBay, AliExpress, Tayda Electronics and many other parts suppliers."},"title":"Input shift registers"},"/docs/hardware/output-shift-register/":{"data":{"alternative-compatible-components#Alternative compatible components":"The following drivers should be pin to pin compatible, albeit with different packages and sometime (mostly negligible) performance differences, but be sure to always check the datasheet of a given component to be sure. They usually have an example circuit. If unsure, politely ask on #hardware or #pcb-design on Discord. Also, if you use any of these listed below, feel free to add coments and vendor links after them,\nSTP16CP05\nTLC5927\nTLC5928\nTLC59283 (SSOP24 p0.64) (cheap on Mouser)\nTB62701\nTB62706\nTB62709\nTB62747 (SSOP24 p1-p0.64) (cheap on Mouser)\nTC62D748 (SSOP24 p0.64) (cheap on Mouser)\nDM13A (SSOP24 p1-p0.64)\nDM134/5/6 (SSOP24 p1-p0.64)\nMBI5024 (SSOP24 p1-p0.64)\nMBI5026 (DIP-SOP-SSOP)\nMBI5041 (SSOP24 p1-p0.64)\nSCT2210\nSCT2026\nFD9802","device-configuration---brightness#Device configuration - brightness":"Configure a new device (LED / Output) for your Arduino as follows:\nNote that the selected pin must support PWM. If you do not want to add support for brightness control skip this step and connect pin 13 of the 74HC595 (~OE) directly to ground.","device-configuration---shift-register#Device configuration - shift register":"Configure a new device for your Arduino as follows:\nNote that you are only mapping the three pins to load data into the 74HC595. The brightness control is configured as a separate device in the next section. If you use different pins than D5, D7, and D9 here is how you should map the dropdowns in MobiFlight to the pins on the 74HC595:\nMobiFlight setting 74HC595 input 74HC595 pin Latch RCLK 12 Clock SRCLK 11 Data SER 14 ","making-the-connections#Making the connections":"Connect the 74HC595 to your Arduino and LEDs as follows:\nFor a more detailed tutorial on how to make the connections see this blog post from Last Minute Engineers.","mobiflight-configuration---brightness-output#MobiFlight configuration - brightness output":"If you connected the ~OE pin to your Arduino you can configure an output to vary the brightness of the LEDs as follows:\nThe output value must be in the range of 0-255 to control the brightness so you may need to apply an output transformation to the raw value. It is common for the brightness value to get reported from the sim as a percent so a transformation like this will scale the value appropriately:\n255 * ($/100)","mobiflight-configuration---led-output#MobiFlight configuration - LED output":"For each output you want to assign to an LED configure the output as follows:\nThe Select Pins dropdown will show eight different possible outputs. Select the output associated with the LED you want to light up based on the output. Add additional output configurations for each additional value you want to display, selecting a different output for the remaining configurations.","next-steps#Next steps":"The basic shift register support opens up a wide range of possibilities for MobiFlight. While this tutorial walked through using a basic shift register the same concepts apply to other chips that function like shift registers. LED control chips like the TLC5917IN, TLC5940 and DM13A work the same way with MobiFlight but have the added benefit of ensuring constant current to the LEDs while only requiring a single resistor. While the wiring is slightly different the settings in MobiFlight are the same.","what-youll-need#What you\u0026rsquo;ll need":"As you continue to build panels you may encounter situations where you have more LEDs to control than there are pins available on your Arduino. The solution is to use a shift register like the 74HC595. These allow you to have individual control of 8 LEDs while only using three pins on the Arduino. With the addition of a fourth pin you can also get PWM control of the LED brightness.\nMobiFlight supports up to 32 bits of shift registers in a chain (typically four eight-bit chips), and up to six chains of output shifters can be connected to a single Arduino.\nWhat you’ll need A 74HC595 chip 8 LEDs 8 resistors (220Ω or similar) "},"title":"Output shift registers"}}